{
  "recipes": [
    {
      "image": "https://res.cloudinary.com/eumar-8/image/upload/v1510670116/hkmkaonvd4aabjpzbhhm.jpg",
      "name": "Creamy squash linguine",
      "description": "Rustle up this healthy pasta dish using just four ingredients: butternut squash, garlic cloves, sage and linguine. It's low-calorie and vegan too.\n1.Heat oven to 200C/180C fan/gas 6. Put the squash and garlic on a baking tray and drizzle with the olive oil. Roast for 35-40 mins until soft. Season.\n2.Cook the pasta according to pack instructions. Drain, reserving the water. Use a stick blender to whizz the squash with 400ml cooking water. Heat some oil in a frying pan, fry the sage until crisp, then drain on kitchen paper. Tip the pasta and sauce into the pan and warm through. Scatter with sage.",
      "ingredients": [
        {
          "quantity": "350g ",
          "ingredient": "chopped butternut squash"
        },
        {
          "quantity": "3 peeled ",
          "ingredient": "garlic cloves"
        },
        {
          "quantity": "3 tbsp",
          "ingredient": "olive oil"
        },
        {
          "quantity": "350g ",
          "ingredient": "linguine"
        }
      ],
      "id": 4
    },
    {
      "image": "https://res.cloudinary.com/eumar-8/image/upload/v1510847962/wdycynqakde70ei5lxkw.jpg",
      "name": "Garlicky mushroom penne",
      "description": "Add protein to a vegan pasta dish by using a low-fat houmous in the sauce. With the mushrooms and wholemeal penne, you have a healthy and filling dinner.\n1.To make the houmous, tip the chickpeas and their liquid into a bowl and add the lemon juice, garlic, bouillon, tahini and ground coriander. Blitz to a wet paste with a hand blender, still retaining some texture from the chickpeas.\n2.Cook the pasta according to pack instructions. Meanwhile, heat the oil in a non-stick wok or large frying pan and add the onions and mushrooms, stirring frequently until softened and starting to caramelise.\n3.Drain the pasta and tip in with the mushrooms, then take off the heat and stir through the houmous and parsley. Toss together lightly, squeeze over the lemon juice and serve, adding a dash of water to loosen the mixture a little if needed.",
      "ingredients": [
        {
          "quantity": "210g can",
          "ingredient": " chickpeas, no need to drain"
        },
        {
          "quantity": "1 tbsp ",
          "ingredient": "lemon juice"
        },
        {
          "quantity": "1 large ",
          "ingredient": "garlic clove"
        },
        {
          "quantity": "1 tsp vegetable bouillon",
          "ingredient": "vegetable bouillon"
        },
        {
          "quantity": "2 tsp",
          "ingredient": "tahini"
        },
        {
          "quantity": "¼ tsp ground coriander",
          "ingredient": "ground coriander"
        },
        {
          "quantity": "200g ",
          "ingredient": "closed cup mushrooms, roughly chopped"
        }
      ],
      "id": 5
    },
    {
      "image": "https://res.cloudinary.com/eumar-8/image/upload/v1510848327/z9jnxtylxaxv4iinqozo.png",
      "name": "Gravity-defying sweetie cake",
      "description": "Anti-gravity cakes are this year's must-have trend for birthdays or parties - this stunning Smartie cake will delight kids and grown-ups alike.\nHeat oven to 180C/160C fan/gas 4. Grease and line two 20cm cake tins with baking parchment – if your cake tins are quite shallow, line the sides to a depth of at least 5cm. Put the flour, cocoa powder, baking powder, bicarbonate of soda, sugar and 1 tsp salt in a bowl and mix well. If there are any lumps in the sugar, squeeze these through your fingers to break them up.\nMeasure the buttermilk, coffee, oil and vanilla in a jug. Add the egg and whisk until smooth. Pour the wet ingredients into the dry and whisk until well combined. Pour the cake mixture evenly into the two tins, and bake for 25-30 mins until risen and a skewer inserted into the centre comes out clean. Cool in the tins for 10 mins, then turn out onto a wire rack, peel off the baking parchment and leave to cool. These sponges can be made up to three days ahead and will stay moist if wrapped in cling film, or you can wrap well and freeze for up to two months.\nTo make the chocolate fudge icing, put the chocolate in a heatproof bowl, suspended over a pan of barely simmering water. Stir every now and then until melted. (Alternatively, melt in the microwave, stirring the chocolate every 20 secs so it doesn’t burn.) Remove the bowl from the heat and leave to cool a little. Meanwhile, put the butter and icing sugar in another large bowl and mash with a spatula to combine (this will prevent you covering the work surface in icing sugar), then whisk with a hand mixer until smooth. Sift in the cocoa and pour in the melted chocolate and milk, then mix again until smooth.\nUse roughly half the icing to sandwich the cakes together on a cake stand or board. Use a palette knife to cover the entire cake with the remaining icing – don’t worry about being too neat. Use the chocolate fingers to cover the sides of the cakes – do this straight after icing as the icing will set after a while, and the chocolate fingers won’t stick.\nMelt the remaining 50g chocolate in the microwave or in a small bowl suspended over a pan of gently simmering water. Leave to cool until the chocolate is a spreadable consistency. You can speed this up by putting it in the fridge – just stir it every 5 mins or so to prevent the chocolate from setting.\nPush a skewer into the centre of the cake and slip the straw over the top – this will give it more stability. Push 1-2cm of the straw into the cake. Use a cutlery knife to spread a blob of chocolate onto a Smartie and, starting at the base, stick the Smarties to the straw. You will have to do this in stages to allow the chocolate to set a little before adding another layer of Smarties. Work your way up the straw until it’s completely covered. If the chocolate in your bowl becomes too firm, simply heat again until it is at the correct consistency. Stop when you reach the bend in the straw.\nStick the remaining skewer into the top of the straw so that it pokes out at an angle. Place the paper bag on top – you may have to use a little sticky tape to hold it in place. If any of the straw is exposed, cover it with more Smarties.\nTip the remaining Smarties on top of the cake to flood the surface. Will keep well stored in an airtight tin for 2 days.",
      "ingredients": [
        {
          "quantity": "150ml",
          "ingredient": " vegetable oil, plus extra for greasing"
        },
        {
          "quantity": "200g ",
          "ingredient": "plain flour"
        },
        {
          "quantity": "8 tbsp ",
          "ingredient": "cocoa powder"
        },
        {
          "quantity": "1 tsp ",
          "ingredient": "bicarbonate of soda"
        },
        {
          "quantity": "280g ",
          "ingredient": "light brown soft sugar"
        },
        {
          "quantity": "1",
          "ingredient": "light brown soft sugar"
        },
        {
          "quantity": "100ml ",
          "ingredient": "strong coffee or espresso"
        },
        {
          "quantity": "2 ",
          "ingredient": "tsp vanilla extract"
        }
      ],
      "id": 6
    },
    {
      "image": "https://res.cloudinary.com/eumar-8/image/upload/v1510849383/ojyawdhyleaqtt9lm0hc.jpg",
      "name": "Lemon curd & blueberry loaf cake",
      "description": "Heat oven to 160C/140C fan/gas 3. Grease a 2lb loaf tin and line with a long strip of baking parchment. Put 100g yogurt, 2 tbsp lemon curd, the softened butter, eggs, lemon zest, flour and caster sugar into a large mixing bowl. Quickly mix with an electric whisk until the batter just comes together. Scrape half into the prepared tin. Weigh 85g blueberries from the punnet and sprinkle half into the tin, scrape the rest of the batter on top, then scatter the other half of the 85g berries on top. Bake for 1 hr 10 mins-1 hr 15 mins until golden, and a skewer poked into the centre comes out clean.\nCool in the tin, then carefully lift onto a serving plate to ice. Sift the icing sugar into a bowl and stir in enough lemon juice to make a thick, smooth icing. Spread over the top of the cake, then decorate with lemon zest and edible flowers, if you like. Serve in slices with extra lemon curd, Greek yogurt and blueberries.",
      "ingredients": [
        {
          "quantity": "175g ",
          "ingredient": "softened butter , plus extra for greasing"
        },
        {
          "quantity": "500ml ",
          "ingredient": "tub Greek yogurt (you need 100ml/3½ fl oz in the cake, the rest to serve)"
        },
        {
          "quantity": "300g ",
          "ingredient": "jar good lemon curd (you need 2 tbsp in the cake, the rest to serve)"
        },
        {
          "quantity": "3",
          "ingredient": "eggs"
        },
        {
          "quantity": "zest and juice 1 lemon ",
          "ingredient": "plus extra zest to serve, if you like"
        }
      ],
      "id": 7
    }
  ]
}
